In [1]:
import pandas as pd
import numpy as np

In [7]:
df = pd.DataFrame({'col1':[1,2,3,4], 'col2':[111,222,333,111], 'col3':['abc', 'def', 'ghi', 'jlm']})

In [8]:
df

   col1  col2 col3
0     1   111  abc
1     2   222  def
2     3   333  ghi
3     4   111  jlm

In [9]:
#informações do dataframe
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col1    4 non-null      int64
 1   col2    4 non-null      int64
 2   col3    4 non-null      object
dtypes: int64(2), object(1)
memory usage: 228.0+ bytes

In [10]:
#quantidade de memória usada por cada coluna
df.memory_usage()

Index    132
col1      32
col2      32
col3      32
dtype: int64

In [11]:
df

   col1  col2 col3
0     1   111  abc
1     2   222  def
2     3   333  ghi
3     4   111  jlm

In [12]:
#mostra os valores unicos de cada coluna
df['col2'].unique()

array([111, 222, 333], dtype=int64)

In [13]:
#mostra a quantidde de valores unicos de cada coluna
df['col2'].nunique()

3

In [14]:
#quantidade de valores repetidos ou não na coluna
df['col2'].value_counts()

111    2
222    1
333    1
Name: col2, dtype: int64

In [20]:
#criando uma função pra calcular com dados da col1
def comp(x):
    return x ** 2 + 3

In [21]:
#aplicando a função na coluna col1
df['col1'].apply(comp)

0     4
1     7
2    12
3    19
Name: col1, dtype: int64

In [16]:
df

   col1  col2 col3
0     1   111  abc
1     2   222  def
2     3   333  ghi
3     4   111  jlm

In [22]:
#cria uma coluna e insere os dados calculados pela função comp
df['col1_calc'] = df['col1'].apply(comp)

In [23]:
df

   col1  col2 col3  col1_calc
0     1   111  abc          4
1     2   222  def          7
2     3   333  ghi         12
3     4   111  jlm         19

In [24]:
#função lambda reduz a função
df['col1'].apply(lambda x: x ** 2 + 3)

0     4
1     7
2    12
3    19
Name: col1, dtype: int64

In [25]:
df

   col1  col2 col3  col1_calc
0     1   111  abc          4
1     2   222  def          7
2     3   333  ghi         12
3     4   111  jlm         19

In [26]:
#soma
df['col1'].sum()

10

In [27]:
#média
df['col1'].mean()

2.5

In [28]:
#produto
df['col1'].product()

24

In [29]:
#desvio padrão
df['col1'].std()

1.2909944487358056

In [30]:
#valor máximo
df['col1'].max()

4

In [31]:
#valor minimo
df['col1'].max()

4

In [32]:
#indice com maior valor
df['col1'].idxmax()

3

In [33]:
#indice com menor valor
df['col1'].idxmin()

0

In [35]:
#colunas com o mesmo valor
df[df['col2'] == 111]

   col1  col2 col3  col1_calc
0     1   111  abc          4
3     4   111  jlm         19

In [37]:
df

   col1  col2 col3  col1_calc
0     1   111  abc          4
1     2   222  def          7
2     3   333  ghi         12
3     4   111  jlm         19

In [36]:
#colunas com o mesmo valor e soma
df[df['col2'] == 111]['col1'].sum()

5

In [38]:
#ordenando dados por colunas
df.sort_values(by='col2')

   col1  col2 col3  col1_calc
0     1   111  abc          4
3     4   111  jlm         19
1     2   222  def          7
2     3   333  ghi         12

In [39]:
data = {
        'A':['foo','foo','foo','bar','bar','bar'],
        'B':['one','one','two','two','one','one'],
        'C':['x','y','x','y','x','y'],
        'D':[1,3,2,5,4,1]
        }
df = pd.DataFrame(data)

In [40]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [42]:
#map mapeia o dataframe e define regras substitui string por number
dict_map = {'one': '1', 'two': '2'}

In [43]:
#joga os valores de dict_map em uma nova coluna
df['E'] = df['B'].map(dict_map)

In [44]:
df

     A    B  C  D  E
0  foo  one  x  1  1
1  foo  one  y  3  1
2  foo  two  x  2  2
3  bar  two  y  5  2
4  bar  one  x  4  1
5  bar  one  y  1  1

In [46]:
#pivot_table reorganiza a tabela com determinados parâmetros
df.pivot_table(index='A', columns='B', values='D')

B    one  two
A
bar  2.5  5.0
foo  2.0  2.0